//
//  Book.swift
//  SwiftUI-Assignment-3
//
//  Created by NikoDanelia on 21/09/2026.
//

import Foundation


struct Book: Identifiable, Hashable {
    let id = UUID()
    let title: String
    let author: String
    let emoji: String
    let about: String
}


let sampleBooks: [Book] = [
    .init(
        title: "ვერ გამტეხ",
        author: "დევიდ გოგინსი",
        emoji: "🔥",
        about: "წიგნი მოგვითხრობს გოგინსის ცხოვრებისეულ გზაზე — ტრავმული ბავშვობიდან, ძალადობისა და მძიმე სიმსუქნისგან თავის დაღწევით დაწყებული, მსოფლიოში გამძლეობაზე ორიენტირებულ ერთ-ერთ უძლიერეს სპორტსმენად და სამხედრო სფეროს საკულტო ფიგურად ჩამოყალიბებამდე."
    ),
    .init(
        title: "1984",
        author: "ჯორჯ ორუელი",
        emoji: "👁️",
        about: "შემაძრწუნებელი დისტოპიური რომანი, რომლის მოქმედებაც „დიდი ძმის“ მიერ მართულ ტოტალიტარულ საზოგადოებაში ვითარდება და რომელიც თვალთვალის, ჭეშმარიტებისა და ინდივიდუალობის თემებს იკვლევს."
    ),
    .init(
        title: "ალქიმიკოსი",
        author: "პაულო კოელიო",
        emoji: "✨",
        about: "შთამაგონებელი იგავი ანდალუსიელ ახალგაზრდა მწყემსზე, რომელიც დამალული განძის საძიებლად ეგვიპტეში მიემგზავრება და საკუთარი გულის ხმის მოსმენის მნიშვნელობას აღმოაჩენს."
    ),
    .init(
        title: "ღრმა მუშაობა",
        author: "კელ ნიუპორტი",
        emoji: "🧠",
        about: "პრაქტიკული სახელმძღვანელო იმის შესახებ, თუ როგორ შეინარჩუნოთ ყურადღება და თავი აარიდოთ ყურადღების გაფანტვას დაძაბულ სამყაროში, როგორ აითვისოთ რთული ინფორმაცია და მიაღწიოთ უკეთეს შედეგებს ნაკლებ დროში."
    ),
    .init(
        title: "ატომური ჩვევები",
        author: "ჯეიმს ქლეარი",
        emoji: "⚡️",
        about: "კარგი ჩვევების გამომუშავებისა და ცუდი ჩვევებისგან გათავისუფლების მარტივი და გამოცდილი გზა, რომელიც ყოველდღიური გაუმჯობესების ჩარჩოს გვთავაზობს."
    )
]

